In [ ]:
print('hi')

[GOOGLE](https://google)

텍스트

In [1]:
import pandas as pd
import numpy as np

In [ ]:
print(pd.__version__)

In [ ]:
pd.__version__
pd.__version__

In [ ]:
a = 1
b = 2

In [ ]:
print(a)
print(b)

In [ ]:
a

In [ ]:
b

### 시리즈

- 같은 종류의 데이터 집합, 컬럼단위

In [5]:
pd.Series([1,3,5,np.nan,6,8])

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
pd.Series([1,3,5,7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: int64

In [8]:
pd.Series([1,3,5,7,6,8], dtype="int32")

0    1
1    3
2    5
3    7
4    6
5    8
dtype: int32

In [9]:
pd.Series([1,3,'5',7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: object

In [12]:
dates = pd.date_range("20130101", periods=6)

In [13]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [46]:
df = pd.DataFrame(np.random.randn(6, 4),
             index=dates,
             columns=list("ABCD"))

In [47]:
# list("ABCD")

In [18]:
pd.DataFrame(np.random.randn(6, 4))

          0         1         2         3
0  0.584520  2.238334  0.245826  0.537887
1  0.742590 -0.222227 -0.736194 -0.955321
2  1.434572 -0.848115 -0.452164 -0.316753
3  0.008412 -0.597525  0.534155  0.116872
4  0.787485  0.271259 -0.743204 -1.591902
5 -0.226462  0.309800  0.566256  1.318966

In [25]:
df2 = pd.DataFrame(
    {
        "A":0.1,
        "B":pd.Timestamp("20130102"),
        "C":pd.Series(1, index=list(range(4)),dtype="float32"),
        "D":np.array([3]*4,dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"foo",
    }
)

In [26]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [27]:
type(df2)

pandas.core.frame.DataFrame

In [29]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [30]:
df2.shape

(4, 6)

In [31]:
df2.ndim

2

In [33]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [35]:
df2.head(2)

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo

In [36]:
df2.tail(2)

     A          B    C  D      E    F
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [37]:
df2.sample(2)

     A          B    C  D      E    F
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [38]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [39]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [40]:
df2.values

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [41]:
type(df2.index)

pandas.core.indexes.numeric.Int64Index

In [42]:
type(df2.columns)

pandas.core.indexes.base.Index

In [43]:
type(df2.values)

numpy.ndarray

In [44]:
df2.to_numpy()

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [48]:
df

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-05 -3.294868  0.370999  0.371807  0.121308
2013-01-06  0.515785 -2.794665  1.281897  0.488336

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [50]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.600959 -0.444848 -0.087590  0.440764
std    1.671265  1.207488  0.949538  0.390419
min   -3.294868 -2.794665 -1.264777  0.006740
25%   -1.472959 -0.413482 -0.786813  0.147783
50%    0.009891 -0.119015 -0.022977  0.357771
75%    0.404387  0.318810  0.402793  0.779647
max    1.100692  0.410495  1.281897  0.924245

In [51]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   0.1  1.0  3.0
std    0.0  0.0  0.0
min    0.1  1.0  3.0
25%    0.1  1.0  3.0
50%    0.1  1.0  3.0
75%    0.1  1.0  3.0
max    0.1  1.0  3.0

In [52]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.050412   -1.947141    1.100692    0.070193   -3.294868    0.515785
B   -0.417885   -0.400274    0.410495    0.162244    0.370999   -2.794665
C    0.413122   -0.417761   -1.264777   -0.909830    0.371807    1.281897
D    0.876750    0.006740    0.227206    0.924245    0.121308    0.488336

In [53]:
df.transpose()

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.050412   -1.947141    1.100692    0.070193   -3.294868    0.515785
B   -0.417885   -0.400274    0.410495    0.162244    0.370999   -2.794665
C    0.413122   -0.417761   -1.264777   -0.909830    0.371807    1.281897
D    0.876750    0.006740    0.227206    0.924245    0.121308    0.488336

In [58]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06  0.515785 -2.794665  1.281897  0.488336
2013-01-05 -3.294868  0.370999  0.371807  0.121308
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-01 -0.050412 -0.417885  0.413122  0.876750

In [59]:
df.sort_index(ascending=False, axis=1)

                   D         C         B         A
2013-01-01  0.876750  0.413122 -0.417885 -0.050412
2013-01-02  0.006740 -0.417761 -0.400274 -1.947141
2013-01-03  0.227206 -1.264777  0.410495  1.100692
2013-01-04  0.924245 -0.909830  0.162244  0.070193
2013-01-05  0.121308  0.371807  0.370999 -3.294868
2013-01-06  0.488336  1.281897 -2.794665  0.515785

In [61]:
df.sort_values(by=["A","B"],ascending=False)

                   A         B         C         D
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-06  0.515785 -2.794665  1.281897  0.488336
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-05 -3.294868  0.370999  0.371807  0.121308

In [63]:
df['A']

2013-01-01   -0.050412
2013-01-02   -1.947141
2013-01-03    1.100692
2013-01-04    0.070193
2013-01-05   -3.294868
2013-01-06    0.515785
Freq: D, Name: A, dtype: float64

In [67]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206

In [69]:
df['2013-01-02':'2013-01-04']

                   A         B         C         D
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245

df.loc[label] 컬럼 인덱스 이름 그대로
df.iloc[position] 인덱스

In [71]:
df

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-05 -3.294868  0.370999  0.371807  0.121308
2013-01-06  0.515785 -2.794665  1.281897  0.488336

In [74]:
df.loc['2013-01-03':'2013-01-04','B':'C']

                   B         C
2013-01-03  0.410495 -1.264777
2013-01-04  0.162244 -0.909830

In [76]:
df.loc[['2013-01-03','2013-01-04'],['B','C']]

                   B         C
2013-01-03  0.410495 -1.264777
2013-01-04  0.162244 -0.909830

In [77]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [78]:
df

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-05 -3.294868  0.370999  0.371807  0.121308
2013-01-06  0.515785 -2.794665  1.281897  0.488336

In [82]:
df.iloc[1:3,2:4]

                   C         D
2013-01-02 -0.417761  0.006740
2013-01-03 -1.264777  0.227206

In [83]:
#df[조건]

In [84]:
df[df['A']>0]

                   A         B         C         D
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-06  0.515785 -2.794665  1.281897  0.488336

In [85]:
df['A']>0

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06     True
Freq: D, Name: A, dtype: bool

In [86]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.413122  0.876750
2013-01-02       NaN       NaN       NaN  0.006740
2013-01-03  1.100692  0.410495       NaN  0.227206
2013-01-04  0.070193  0.162244       NaN  0.924245
2013-01-05       NaN  0.370999  0.371807  0.121308
2013-01-06  0.515785       NaN  1.281897  0.488336

In [87]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [89]:
df2=df.copy()

In [98]:
df2["E"]= ["one", "one", "two", "three", "four", "three"]

In [99]:
df2

                   A         B         C         D      E
2013-01-01 -0.050412 -0.417885  0.413122  0.876750    one
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740    one
2013-01-03  1.100692  0.410495 -1.264777  0.227206    two
2013-01-04  0.070193  0.162244 -0.909830  0.924245  three
2013-01-05 -3.294868  0.370999  0.371807  0.121308   four
2013-01-06  0.515785 -2.794665  1.281897  0.488336  three

In [100]:
df2[df2["E"].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.100692  0.410495 -1.264777  0.227206   two
2013-01-05 -3.294868  0.370999  0.371807  0.121308  four

In [101]:
df

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-05 -3.294868  0.370999  0.371807  0.121308
2013-01-06  0.515785 -2.794665  1.281897  0.488336

In [102]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns) + ["E"])

In [103]:
df1

                   A         B         C         D   E
2013-01-01 -0.050412 -0.417885  0.413122  0.876750 NaN
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740 NaN
2013-01-03  1.100692  0.410495 -1.264777  0.227206 NaN
2013-01-04  0.070193  0.162244 -0.909830  0.924245 NaN

In [104]:
df1.loc[dates[0]:dates[1],"E"] = 1

In [105]:
df1

                   A         B         C         D    E
2013-01-01 -0.050412 -0.417885  0.413122  0.876750  1.0
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740  1.0
2013-01-03  1.100692  0.410495 -1.264777  0.227206  NaN
2013-01-04  0.070193  0.162244 -0.909830  0.924245  NaN

In [106]:
df4 = df1.copy()

In [112]:
df4.dropna(how='any',axis=1)

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245

In [119]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns) + ["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C         D    E
2013-01-01 -0.050412 -0.417885  0.413122  0.876750  1.0
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740  1.0
2013-01-03  1.100692  0.410495 -1.264777  0.227206  NaN
2013-01-04  0.070193  0.162244 -0.909830  0.924245  NaN

In [122]:
df1['E'].mean()

1.0

In [124]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01 -0.050412 -0.417885  0.413122  0.876750  1.0
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740  1.0
2013-01-03  1.100692  0.410495 -1.264777  0.227206  1.0
2013-01-04  0.070193  0.162244 -0.909830  0.924245  1.0

In [127]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns) + ["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1.loc[dates[0], 'A']=np.nan
df1.loc[dates[1], 'B']=np.nan
df1.loc[dates[3], 'C']=np.nan
df1.loc[dates[1], 'D']=np.nan
df1

                   A         B         C         D    E
2013-01-01       NaN -0.417885  0.413122  0.876750  1.0
2013-01-02 -1.947141       NaN -0.417761       NaN  1.0
2013-01-03  1.100692  0.410495 -1.264777  0.227206  NaN
2013-01-04  0.070193  0.162244       NaN  0.924245  NaN

In [129]:
df1.mean()

A   -0.258752
B    0.051618
C   -0.423139
D    0.676067
E    1.000000
dtype: float64

In [130]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01 -0.258752 -0.417885  0.413122  0.876750  1.0
2013-01-02 -1.947141  0.051618 -0.417761  0.676067  1.0
2013-01-03  1.100692  0.410495 -1.264777  0.227206  1.0
2013-01-04  0.070193  0.162244 -0.423139  0.924245  1.0

In [133]:
df2[df2["E"].isin(['two',"four"])]

                   A         B         C         D     E
2013-01-03  1.100692  0.410495 -1.264777  0.227206   two
2013-01-05 -3.294868  0.370999  0.371807  0.121308  four

In [135]:
df2[(df2['E']=='two')| (df2['E']=='four')]

                   A         B         C         D     E
2013-01-03  1.100692  0.410495 -1.264777  0.227206   two
2013-01-05 -3.294868  0.370999  0.371807  0.121308  four

In [136]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [137]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4 entries, 2013-01-01 to 2013-01-04
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       3 non-null      float64
 4   E       2 non-null      float64
dtypes: float64(5)
memory usage: 364.0 bytes

In [138]:
df1.isna()

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [145]:
df1.isna().sum()/df1.shape[0]*100

A    25.0
B    25.0
C    25.0
D    25.0
E    50.0
dtype: float64

In [141]:
df1.isna().sum().sum()

6

In [147]:
df

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-05 -3.294868  0.370999  0.371807  0.121308
2013-01-06  0.515785 -2.794665  1.281897  0.488336

In [143]:
df1.count()

A    3
B    3
C    3
D    3
E    2
dtype: int64

In [148]:
df

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.947141 -0.400274 -0.417761  0.006740
2013-01-03  1.100692  0.410495 -1.264777  0.227206
2013-01-04  0.070193  0.162244 -0.909830  0.924245
2013-01-05 -3.294868  0.370999  0.371807  0.121308
2013-01-06  0.515785 -2.794665  1.281897  0.488336

In [152]:
df.mean(0)

A   -0.600959
B   -0.444848
C   -0.087590
D    0.440764
dtype: float64

In [151]:
df.mean(1)

2013-01-01    0.205394
2013-01-02   -0.689609
2013-01-03    0.118404
2013-01-04    0.061713
2013-01-05   -0.607689
2013-01-06   -0.127162
Freq: D, dtype: float64

In [153]:
df.var()

A    2.793127
B    1.458027
C    0.901623
D    0.152427
dtype: float64

In [154]:
df.max()

A    1.100692
B    0.410495
C    1.281897
D    0.924245
dtype: float64

In [155]:
df.min()

A   -3.294868
B   -2.794665
C   -1.264777
D    0.006740
dtype: float64

In [156]:
df.median()

A    0.009891
B   -0.119015
C   -0.022977
D    0.357771
dtype: float64

In [157]:
df.std()

A    1.671265
B    1.207488
C    0.949538
D    0.390419
dtype: float64

In [158]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.050412 -0.417885  0.413122  0.876750
2013-01-02 -1.997553 -0.818159 -0.004639  0.883490
2013-01-03 -0.896861 -0.407664 -1.269416  1.110696
2013-01-04 -0.826668 -0.245420 -2.179246  2.034941
2013-01-05 -4.121537  0.125579 -1.807439  2.156250
2013-01-06 -3.605752 -2.669087 -0.525541  2.644586

In [160]:
def dataa(x):
    return x.max()-x.min()
df.apply(dataa)

A    4.395560
B    3.205160
C    2.546674
D    0.917505
dtype: float64

In [162]:
df.apply(lambda x: x.max()-x.min())

A    4.395560
B    3.205160
C    2.546674
D    0.917505
dtype: float64

In [163]:
gender=pd.Series(["남자","여자","여자","여자","남","male"])

In [164]:
gender.value_counts()

여자      3
남자      1
남       1
male    1
dtype: int64

In [165]:
gender.replace("남","남자")

0      남자
1      여자
2      여자
3      여자
4      남자
5    male
dtype: object

In [169]:
gender

0      남자
1      여자
2      여자
3      여자
4       남
5    male
dtype: object

In [168]:
gender.replace(["남","male"],["남자","남자"])

0    남자
1    여자
2    여자
3    여자
4    남자
5    남자
dtype: object

In [170]:
gender.str.replace("남","남자")

0     남자자
1      여자
2      여자
3      여자
4      남자
5    male
dtype: object

In [171]:
df = pd.DataFrame(np.random.randn(10, 4))

In [172]:
df

          0         1         2         3
0 -1.326885  0.133339  0.629377 -0.305571
1 -0.371209 -0.630511  0.328851 -0.942330
2  0.568525  1.036043  1.381172  0.455207
3 -0.198084  2.181225  1.407849  1.451943
4 -0.276613 -0.943914  0.548288  0.108133
5 -0.432914 -0.675936  0.467994 -0.958855
6 -1.290111  0.569510 -1.539184  0.760971
7  1.025016  0.562053 -1.565158  0.349620
8  1.809216  0.851914  0.738921  1.358075
9 -0.611553  0.347890  0.217435  0.470157

In [173]:
pieces = [df[:3],df[3:7],df[7:]]

In [175]:
pieces[0]

          0         1         2         3
0 -1.326885  0.133339  0.629377 -0.305571
1 -0.371209 -0.630511  0.328851 -0.942330
2  0.568525  1.036043  1.381172  0.455207

In [178]:
pieces[1]

          0         1         2         3
3 -0.198084  2.181225  1.407849  1.451943
4 -0.276613 -0.943914  0.548288  0.108133
5 -0.432914 -0.675936  0.467994 -0.958855
6 -1.290111  0.569510 -1.539184  0.760971

In [179]:
pieces[2]

          0         1         2         3
7  1.025016  0.562053 -1.565158  0.349620
8  1.809216  0.851914  0.738921  1.358075
9 -0.611553  0.347890  0.217435  0.470157

In [183]:
pd.concat([pieces[0],pieces[1],pieces[2]], axis=0, join='inner')

          0         1         2         3
0 -1.326885  0.133339  0.629377 -0.305571
1 -0.371209 -0.630511  0.328851 -0.942330
2  0.568525  1.036043  1.381172  0.455207
3 -0.198084  2.181225  1.407849  1.451943
4 -0.276613 -0.943914  0.548288  0.108133
5 -0.432914 -0.675936  0.467994 -0.958855
6 -1.290111  0.569510 -1.539184  0.760971
7  1.025016  0.562053 -1.565158  0.349620
8  1.809216  0.851914  0.738921  1.358075
9 -0.611553  0.347890  0.217435  0.470157

In [184]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [185]:
left

   key  lval
0  foo     1
1  foo     2

In [186]:
right

   key  rval
0  foo     4
1  foo     5

In [188]:
pd.merge(left, right,left_on="key", right_on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [191]:
left.set_index('key', inplace=True)
right.set_index('key', inplace=True)

In [192]:
left.join(right)

     lval  rval
key
foo     1     4
foo     1     5
foo     2     4
foo     2     5

In [193]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [194]:
df

     A      B         C         D
0  foo    one -0.177499 -0.295929
1  bar    one  0.428656  0.678137
2  foo    two  1.387480  0.473960
3  bar  three -0.780982  0.145354
4  foo    two -0.273267 -0.270472
5  bar    two  1.557085 -1.001603
6  foo    one  0.292275  0.235988
7  foo  three -0.780083 -0.137085

In [196]:
df.sum()

A        foobarfoobarfoobarfoofoo
B    oneonetwothreetwotwoonethree
C                        1.653666
D                       -0.171649
dtype: object

In [197]:
test = df.groupby(["A","B"]).sum()

In [198]:
test

                  C         D
A   B
bar one    0.428656  0.678137
    three -0.780982  0.145354
    two    1.557085 -1.001603
foo one    0.114776 -0.059941
    three -0.780083 -0.137085
    two    1.114214  0.203488

In [201]:
test.stack()

A    B
bar  one    C    0.428656
            D    0.678137
     three  C   -0.780982
            D    0.145354
     two    C    1.557085
            D   -1.001603
foo  one    C    0.114776
            D   -0.059941
     three  C   -0.780083
            D   -0.137085
     two    C    1.114214
            D    0.203488
dtype: float64

In [202]:
test1 = test.stack()
test1.unstack()

                  C         D
A   B
bar one    0.428656  0.678137
    three -0.780982  0.145354
    two    1.557085 -1.001603
foo one    0.114776 -0.059941
    three -0.780083 -0.137085
    two    1.114214  0.203488

In [204]:
test1.unstack(1)

B           one     three       two
A
bar C  0.428656 -0.780982  1.557085
    D  0.678137  0.145354 -1.001603
foo C  0.114776 -0.780083  1.114214
    D -0.059941 -0.137085  0.203488

In [205]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [206]:
df

        A  B    C         D         E
0     one  A  foo -0.493003  0.301185
1     one  B  foo -0.147179  0.727430
2     two  C  foo -2.463317  0.916171
3   three  A  bar -1.170707 -0.063484
4     one  B  bar -0.113443 -1.034979
5     one  C  bar -0.015824  0.274095
6     two  A  foo  2.072163 -0.418666
7   three  B  foo  0.372833  0.012826
8     one  C  foo  1.740177 -1.825039
9     one  A  bar  1.466506 -0.137661
10    two  B  bar -0.021287 -0.056084
11  three  C  bar -1.557944  1.891054

In [209]:
test = pd.pivot_table(df,values="D", index=["A","B"],columns=["C"],aggfunc="sum")

In [214]:
test.reset_index(inplace=True)

In [215]:
test.head(2)

C    A  B       bar       foo
0  one  A  1.466506 -0.493003
1  one  B -0.113443 -0.147179

In [216]:
test.melt(id_vars=['A','B'])

        A  B    C     value
0     one  A  bar  1.466506
1     one  B  bar -0.113443
2     one  C  bar -0.015824
3   three  A  bar -1.170707
4   three  B  bar       NaN
5   three  C  bar -1.557944
6     two  A  bar       NaN
7     two  B  bar -0.021287
8     two  C  bar       NaN
9     one  A  foo -0.493003
10    one  B  foo -0.147179
11    one  C  foo  1.740177
12  three  A  foo       NaN
13  three  B  foo  0.372833
14  three  C  foo       NaN
15    two  A  foo  2.072163
16    two  B  foo       NaN
17    two  C  foo -2.463317

In [219]:
data = pd.read_csv('전라북도_소방서별 소방자동차 현황_20170810..csv',encoding='cp949')
data.head(2)

,시군,고가차 53(m),고가차 52(m),고가차 46(m),굴 절차 36(m),굴 절차 28(m),굴 절차 27(m),배 연 차,구 급 차,구조차 버스,...,굴 삭 기,"트레일러 공기,양수",트레일러 보트,이동정비차,이동체험차,장비운반차,이동중계차,산불진화차,유 조 차,버 스
0,본부,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,1,1.0,NaN,1.0,2.0
1,덕진,1.0,NaN,NaN,NaN,NaN,1.0,NaN,10.0,1.0,...,NaN,1.0,1.0,NaN,NaN,1,NaN,1.0,NaN,NaN

In [221]:
data.melt(id_vars="시군")

      시군   variable  value
0     본부  고가차 53(m)    NaN
1     덕진  고가차 53(m)    1.0
2     완산  고가차 53(m)    NaN
3     군산  고가차 53(m)    NaN
4     익산  고가차 53(m)    1.0
..   ...        ...    ...
369   남원      버   스    NaN
370   김제      버   스    NaN
371   고창      버   스    NaN
372   부안      버   스    NaN
373  무진장      버   스    NaN

[374 rows x 3 columns]